Revit 2025 API
ElectricalPerPhaseData Class
 This class represents per phase values including current and load.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ElectricalPerPhaseData : IDisposable
Public Class ElectricalPerPhaseData
	Implements IDisposable
public ref class ElectricalPerPhaseData : IDisposable
type ElectricalPerPhaseData =
    class
        interface IDisposable
    end
The ElectricalPerPhaseData type exposes the following members.
Properties
Name | Description
CurrentPhaseA |  The value of current on electrical phase A.
CurrentPhaseB |  The value of current on electrical phase B.
CurrentPhaseC |  The value of current on electrical phase C.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ElectricalPerPhaseData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace